## Assignment A3- Descriptive Statistics - Measures of Central Tendency and variability

In [2]:
#importing libraries 
import pandas as pd 
import numpy as np
import matplotlib.pyplot as plt

### Part 1: Summary statistics

In [2]:
data = pd.read_csv('nba.csv')
data.head()

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0

#### Decription of dataset:
The given dataset contains player data for different NBA teams. Different atrributes included in the dataset are:
1. Name and Team with number
2. Position
3. Age
4. Height
5. Weight
6. College and Salary

In [3]:
data.describe()

           Number         Age      Weight        Salary
count  457.000000  457.000000  457.000000  4.460000e+02
mean    17.678337   26.938731  221.522976  4.842684e+06
std     15.966090    4.404016   26.368343  5.229238e+06
min      0.000000   19.000000  161.000000  3.088800e+04
25%      5.000000   24.000000  200.000000  1.044792e+06
50%     13.000000   26.000000  220.000000  2.839073e+06
75%     25.000000   30.000000  240.000000  6.500000e+06
max     99.000000   40.000000  307.000000  2.500000e+07

In [5]:
# Mean values
print("Mean of age:",data["Age"].mean())
print("Mean of salary:",data["Salary"].mean())

Mean of age: 26.938730853391686
Mean of salary: 4842684.105381166

In [8]:
# Median values
print("Median of age:",data["Age"].median())
print("Median of salary:",data["Salary"].median())

Median of age: 26.0
Median of salary: 2839073.0

In [10]:
# Standard deviation values
print("Standard deviation of age:",data["Age"].std())
print("Standard deviation of salary:",data["Salary"].std())

Standard deviation of age: 4.404016424405833
Standard deviation of salary: 5229237.598910348

### Grouping by categorical variable

In [26]:
group=data.groupby(pd.cut(data["Age"], np.arange(15, 45, 5))).sum()
group

          Number     Age   Weight        Salary
Age
(15, 20]   348.0   418.0   4659.0  5.565091e+07
(20, 25]  3198.0  4167.0  38635.0  5.232390e+08
(25, 30]  2846.0  4653.0  37364.0  1.047480e+09
(30, 35]  1188.0  2215.0  15431.0  4.463557e+08
(35, 40]   499.0   858.0   5147.0  8.711119e+07

In [1]:
group=data.groupby(pd.cut(data["Age"], np.arange(15, 45, 5))).mean()
group

NameError: name 'data' is not defined

In [30]:
#summary stats of grouped data
group.describe()

            Number          Age        Weight        Salary
count     5.000000     5.000000      5.000000  5.000000e+00
mean   1615.800000  2462.200000  20247.200000  4.319674e+08
std    1327.998569  1905.207784  16772.744504  4.024716e+08
min     348.000000   418.000000   4659.000000  5.565091e+07
25%     499.000000   858.000000   5147.000000  8.711119e+07
50%    1188.000000  2215.000000  15431.000000  4.463557e+08
75%    2846.000000  4167.000000  37364.000000  5.232390e+08
max    3198.000000  4653.000000  38635.000000  1.047480e+09

In [67]:
group=group.reset_index()

   level_0     index  Number     Age   Weight        Salary
0        0  (15, 20]   348.0   418.0   4659.0  5.565091e+07
1        1  (20, 25]  3198.0  4167.0  38635.0  5.232390e+08
2        2  (25, 30]  2846.0  4653.0  37364.0  1.047480e+09
3        3  (30, 35]  1188.0  2215.0  15431.0  4.463557e+08
4        4  (35, 40]   499.0   858.0   5147.0  8.711119e+07

In [87]:
list1={}
for i in range(0,len(group)):
    list1[group["index"][i]]=group["Salary"][i]
list1

{Interval(15, 20, closed='right'): 55650906.0,
 Interval(20, 25, closed='right'): 523239046.0,
 Interval(25, 30, closed='right'): 1047480226.0,
 Interval(30, 35, closed='right'): 446355744.0,
 Interval(35, 40, closed='right'): 87111189.0}

### Part 2: Analysis of iris dataset

In [13]:
data = pd.read_csv("Iris.csv")

print('Iris-setosa')
setosa = data['Species'] == 'Iris-setosa' # Indexes are stored in setosa of the Iris-setosa species
print(data[setosa].describe())

print('\nIris-versicolor')
versi = data['Species'] == 'Iris-versicolor'
print(data[versi].describe())

print('\nIris-virginica')
vergi = data['Species'] == 'Iris-virginica'
print(data[vergi].describe())

Iris-setosa
             Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm
count  50.00000       50.00000     50.000000      50.000000      50.00000
mean   25.50000        5.00600      3.418000       1.464000       0.24400
std    14.57738        0.35249      0.381024       0.173511       0.10721
min     1.00000        4.30000      2.300000       1.000000       0.10000
25%    13.25000        4.80000      3.125000       1.400000       0.20000
50%    25.50000        5.00000      3.400000       1.500000       0.20000
75%    37.75000        5.20000      3.675000       1.575000       0.30000
max    50.00000        5.80000      4.400000       1.900000       0.60000

Iris-versicolor
              Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm
count   50.00000      50.000000     50.000000      50.000000     50.000000
mean    75.50000       5.936000      2.770000       4.260000      1.326000
std     14.57738       0.516171      0.313798       0.469911      0.197753
min     51.00000       4.900000      2.000000       3.000000      1.000000
25%     63.25000       5.600000      2.525000       4.000000      1.200000
50%     75.50000       5.900000      2.800000       4.350000      1.300000
75%     87.75000       6.300000      3.000000       4.600000      1.500000
max    100.00000       7.000000      3.400000       5.100000      1.800000

Iris-virginica
              Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm
count   50.00000       50.00000     50.000000      50.000000      50.00000
mean   125.50000        6.58800      2.974000       5.552000       2.02600
std     14.57738        0.63588      0.322497       0.551895       0.27465
min    101.00000        4.90000      2.200000       4.500000       1.40000
25%    113.25000        6.22500      2.800000       5.100000       1.80000
50%    125.50000        6.50000      3.000000       5.550000       2.00000
75%    137.75000        6.90000      3.175000       5.875000       2.30000
max    150.00000        7.90000      3.800000       6.900000       2.50000